ArtMoney Plugin
8.17
Traduzione italiana:
Luciano Prelli
lucypr@tin.it
Informazioni su
Cheater per giochi
<d> <ms> <yyyy>//date format
Copyright (C) 1996-2020, System SoftLab
Se hai trovato degli errori nel programma
o vuoi darci dei suggerimenti, contattaci all'indirizzo
Visita il sito di ArtMoney per avere l'ultima versione
Valore
Cerca
Selezione
Numero di valori
Per prima cosa scegli il processo del gioco
Ora inizia la ricerca all'interno del processo
Opera sul filtro finchè il numero di occorrenze non diminuisce più
Spiacente, non hai trovato nulla. Cerca di nuovo
Disabilita
Trovato 
indirizzi
indirizzi
indirizzo
Nella tabella
Errore nel caricamento
Errore di ricerca
Errore di selezione
Formato non supportato
Impossibile rappresentare il numero nel tipo scelto
Non riesco a caricare
Ricerca in corso
Selezione in corso
tutti possibili
byte
byte
bytes
Metodo errato. Provane un altro.
sec
min
Non hai scelto il tipo per questo metodo
La dimensione del tipo non può essere superiore a
è stato cambiato
non è stato cambiato
è stato aumentato
è stato diminuito
La tabella è stata creata con una versione più recente.
La tabella è danneggiata
Errore di accesso al file
Intero 1 byte
Intero 2 bytes
Intero 3 bytes
Intero 4 bytes
Intero 8 bytes
Virgola mobile 4 bytes
Virgola mobile 6 bytes
Virgola mobile 8 bytes
Virgola mobile 10 bytes
Testo
Stringa terminata con Null
Stringa nulla
Stringa Pascal
I.intero 2 bytes
I.intero 3 bytes
I.intero 4 bytes
I.intero 8 bytes
I.virgola mob. 4 bytes
I.virgola mob. 6 bytes
I.virgola mob. 8 bytes
I.virgola mob. 10 bytes
I.testo
I.stringa nulla
I.stringa Pascal
gennaio
febbraio
marzo
aprile
maggio
giugno
luglio
agosto
settembre
ottobre
novembre
dicembre
C
Aiuto
Informazioni su
Scegli processo
Cancella
Carica
Salva
Aggiungi
Aggiungi tutto
Modifica
Copia
Elimina
Congela
Scongela
Applica offset automaticamente
Informazioni
Tipo di processo
Tempo di congelamento (ms)
Tempo di refresh (ms)
Lingua
Mostra indirizzi
Tasto di scelta rapida popup
Generali
Altre
Personali
Email
Commenti
Sistema operativo
Cifre dopo virgola
Ordine dei bytes
Priorità della scansione
alto
pieno
Opzioni
Annulla
normale
Modifica indirizzo
Congelare
Volume
Indirizzo
Descrizione
Tipo
Invertire
Valore esatto
Successione dei valori
Limiti dei valori
Valore sconosciuto
Valore codificato
Personale
Scegli tipo
Ordine dei byte
normale e inverso
tutti
Interi
Con virgola mobile
Tempo trascorso:
Tempo rimasto:
Velocità:
Trovato:
Gioco
Nota
Data
Sistema
Informazioni sulla tabella
Creato da
Nome
Paese
Inserimento sequenza valori
Imposta hot key
Inverso
Cerca in questo blocco di memoria
Cerca nei limiti di indirizzi
risparmiare spazio sul disco
da
a
Cerca
Seleziona
Intervallo
Intervallo//set value
Imposta valore
Seleziona tutto
AUTO
Mostra processi
visibili
A finestre
Informazioni sul processo
Termina il processo
Visualizza finestra
Nascondi finestra
Sicuro di voler interrompere il processo?
Accesso negato
Impossibile interrompere il processo
Nome file
Tipo del processo
Dimensione dei dati
Benchmark
Test di velocità della scansione memoria
Attendere
Il tuo sistema
Tasti speciali
Aggiungi al valore
Blocca questa finestra
Abilita Annulla/Ripeti filtro
Visualizzazione degli interi
Modulo
Con segno
Annulla filtro
Riapplica filtro
Salva filtro
Carica filtro
Il passaggio attuale è
"Annulla filtro" non abilitato
"Ripeti filtro" non abilitato
"Carica filtro" non abilitato
è stato aumentato di
è stato diminuito di
Interfaccia
Hot Key
Hot Key abilitati
Hot Key predefiniti
Carattere principale
Carattere delle tabelle
Colore principale di sfondo
Colore di sfondo Input
Colore dei tasti
Tasti rotondi
OK
Editor memoria
Visualizzazione esadecimale
Edit esadecimale
Numero di colonne dei valori
Visualizzazione di celle
Cella corrente
Intervallo di spostamento
nei risultati della ricerca
nella tabella
nel blocco di memoria
all'indirizzo
Primo
Precedente
Successivo
Ultimo
Totale
Corrente
Copiare lo spazio
Inserire nello spazio
Aggiungere alla tabella
tutti (standard)
Interi (standard)
Con virgola (standard)
Inverti selezione
Allinea colonne
<NO>
Puntatore
Aggiorna
Modifica selezione
Gruppo
Gruppo visibile
Seleziona gruppo
Salva indirizzo/puntatore
Applica offset automaticamente a tutti
Applica offset automaticamente al gruppo
Applica automaticamente a tutti l'offset dall'indirizzo salvato
Applica automaticamente al gruppo l'offset dall'indirizzo salvato
Operazioni con puntatori
Imposta puntatore per tutti
Imposta puntatore per il gruppo
Imposta puntatore salvato per tutti
Imposta puntatore salvato per il gruppo
Imposta puntatori a questo indirizzo
Imposta puntatori all'indirizzo salvato
Cerca puntatore a questo indirizzo
Cerca puntatore all'inizio del blocco di memoria
Ordina
Ordina per descrizione
Ordina per indirizzo
Ordina per valore
Ordina per valore come testo
Ordina per gruppo
Unisci
Errore di unione
Entrambe le tabelle devono essere create dallo stesso autore
Seleziona il processo corrente
Set caratteri
Mostra pannello Gruppo visibile
nel gruppo
Converti puntatori in indirizzi
Imposta filtro
Stringa
<File non trovato>
<Accesso negato>
Editor di file
Errori
<La dimensione è stata modificata>
Skin
Senza skin
Modifica caratteri
Colore tabella
Salva dump di memoria
Per formula
Processo
Interrompi processo
Ripristina processo
Salva processo
Carica processo
ID processo
Thread
File(s)
Info sui file
Selezionare il file
Selezionare la cartella
Numero di file
Dimensione totale
Spostamento nella cartella
Oggetto
Tabella
Esci
Risultato
Altro
Acquista "ArtMoney Pro" online
Visita la Home page
Manuale di ArtMoney
Codifica
Selezionare la codifica
Luminosità
Tonalità
Mostra il menu principale
Usa plugin di lingua non ufficiali
Interrompi processi durante la ricerca
Salva/carica valori in file tabelle
Libreria per visualizzare processi
Opzioni analisi cartelle
Maschera nome file
Tempo di modifica
Data file
Ora file
Non verificare
Ultimi 15 min
Ultima ora
Ultimo giorno
Ultimo mese
Ultimo anno
Più di
Meno di
Questa funzione è disponibile solo nella versione Pro di ArtMoney 
Solo in ArtMoney Pro
Contratto di licenza
Accetto i termini del Contratto di licenza
Informazioni sulla versione PRO
Ringraziamenti speciali
design del manuale utenti
logo
modulo di installazione
creazione dell'icona
controllo ortografico del manuale inglese
assistenza
pacchetto ThemeEngine (supporto delle skin)
consigli e commenti validi
traduzioni
tabelle
Numero di registrazione
Non registrato
Non richiedere più la password
Solo per l'utente corrente di Windows
Interrompi processo e appari
Commuta e ripristina processo
Parentesi di chiusura superflua
Manca la parentesi di chiusura
Mancano le virgolette di chiusura
ID non valido
Numero di argomenti non valido (M1,M2...)
Numero di operazioni non valido (-,+)
Numero di condizioni non valido (<,>,=)
Numero di espressioni non valido
Espressione non valida
Passaggio non esistente
Condizione non valida
Parametro non valido per
Nessuna condizione
Ricerca
Registrazione
Password
Inserire la password e premere "OK"
Password non valida
File di chiave non valido
File di chiave assente
Predefinito
Annullato dall'utente
Manuale utente
Processo non trovato
Aggiorna valori nella tabella solo se il modulo è attivo
Dimensione codice
Mappa del processo
Indirizzo regione
Stato
Protezione regione
Protezione
Nome modulo
Questa funzione supporta solo Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Salvataggio/Caricamento del processo
Modalità
Processo non valido. Il processo è stato modificato o riavviato.
Chiudi
In Excel
Arrotonda i valori con la virgola
Macromedia Flash
Intervallo
Tieni processo in memoria
Memoria fisica riservata
Esegui nuovo processo
Installa
Crea shortcut sul desktop
Nascondi processo
Mostra processo
Emulatore
Sistema di gioco
Intervallo di indirizzi
Usa opzioni dell'emulatore
Mappa di memoria dell'emulatore
Indirizzo emul.
Indirizzo PC
Convertire indirizzi emulatore in indirizzi PC?
Convertire indirizzi PC in indirizzi emulatore?
Errore di conversione indirizzi
Rileva automaticamente l'emulatore per il nome file
Gruppi
Mostra struttura gruppi
Nessuno
Sinistra
Destra
Nuovo gruppo
Principale
Lingua
Eliminare questa lingua?
Aggiungere una nuova lingua?
Rinominare la lingua?
congelamento normale
può aumentare
può diminuire
dal minimo al massimo
Minimo
Massimo
Copia selezionato
Scarica il programma "Spyware Process Detector"
Programma "Spyware Process Detector" non trovato sul computer. È possibile scaricarlo dal nostro sito aziendale www.systemsoftlab.com. Si può usare il programma insieme a ArtMoney per selezionare processi. Il programma "Spyware Process Detector" permette di aprire qualsiasi processo nascosto o che blocca i tentativi di apertura. Il programma mostra informazioni dettagliate sui processi eseguiti sul PC e rileva nuovi spyware, trojan e virus.
Si prega di inviare i suggerimenti e di segnalare i bug a 
Visita il nostro sito e scarica altri programmi
Questa è una versione gratuita LIMITATA. Potete acquistare la versione completa a soli 19.90 EURO. È un pagamento una tantum, gli aggiornamenti sono gratuiti! 
Solo gli utenti registrati possono ricevere un completo supporto tecnico e usare le funzioni aggiuntive.
Per registrare il programma online, accertarsi di essere connessi a Internet e cliccare sul pulsante Registrazione online sottostante.
Registrazione online
Installazione del servizio
È richiesta l'autenticazione dell'utente per installare il servizio.
Installa come il seguente utente
Nome utente
Dominio
Errore di installazione del servizio. Accesso negato.
Autenticazione non riuscita per l'utente
Modalità nascosta
Nascondi il mio processo
Nascondi la mia finestra
È installata una vecchia versione del servizio. Riavviare il computer per installare una versione nuova.
La tabella è cambiata
Vuoi salvare le modifiche?
Chiedi di salvare la tabella modificata all'uscita
Struttura
Saltato
Campo
Le dimensioni della struttura non possono superare
Elemento
Nuovo elemento
Cerca nella struttura della tabella
Cerca nella struttura del gruppo
Cerca nella struttura degli indirizzi selezionati
Sposta Su
Sposta Giù
Ottenere "ArtMoney Pro" gratis
per la revisione grammaticale del manuale Russo
Tipo di arrotondamento
Arrotonda al più vicino
Arrotonda per difetto
Arrotonda per eccesso
Arrotonda verso lo zero
Continua
Ottienilo gratis
Disassembler
Istruzione assembly
Indirizzamento di modulo
Modulo
Indirizzo nel modulo
Errore di conversione
Non riesco a convertire l'indirizzo di modulo: non vi è tale modulo nel processo.
Scan dell'area di memoria dei moduli di sistema
Scan dell'area di memoria dei moduli condivisi
Errore di apertura del processo
Impossibile aprire questo processo
Prova ad usare la versione PRO.
Per questa tabella è necessaria la versione PRO
Registro non valido
Indirizzo non valido
Valore non valido
Valore troppo alto
Istruzione assembly non valida
Per installare il servizio, fare clic sull'applicazione con il pulsante destro e selezionare "Esegui come amministratore" ("Run as administrator").
Errore di avvio del servizio
Errore di aperetura de servizio
Provare a riavviare il computer
è stato cambiato da
Conversione tabella
Vuoi convertire la tabella in modalità 64-bit?
Vuoi convertire la tabella in modalità 32-bit?
Si è verificato un errore di conversione. Il programma non può convertire gli indirizzi in modalità 32-bit.
Moltiplicità dell'indirizzo//Divisibilità dell'indirizzo
Pari//Divisibilità per 2
Dispari
Multiplo di 4//Divisibilità per 4
Multiplo di 8//Divisibilità per 8
Multiplo di 16//Divisibilità per 16
Esamina solo gli indirizzi statici nei moduli
Visualizza le opzioni del modulo
Inserire il codice di registrazione
Incolla il tuo codice di registrazione (usa Ctrl-V o il tasto "Incolla") and clicca su "OK"
Inxolla
Il codice di registrazione non è valido
Il codice di registrazione è valido solo per la versione inglese
Il codice di registrazione è valido solo per la versione russa
Il codice di registrazione è valido solo per versioni precedenti
Il codice di registrazione non è più valido. Contattare sales@systemsoftlab.com per ottenere un nuovo codice
Se non vedi qui il tuo nome e i tuoi dati, significa che stai usando una versione illegale del programma, che potrebbe non funzionare correttamente! 
Puntatore a Puntatore
Offset massimo
Livello da
Cerca il puntatore a Puntatore
Massimo 2 livelli per la SE edition!
Tenta di disattivare la Verifica della firma dei driver
Fast mode (usa più memoria)
Mb
Applica automaticamente l'offset e opia su un nuovo gruppo
Indirizzo in blocco
Non posso convertire l'indirizzo in blocco: blocco inesistente nel processo
Problema di conversione: dimensioni del blocco non univoche
Ordine i puntatori in base all'offset
Nascondi il testo in modo totalmente silenzioso // Solo VIP
Compra o vendi account di gioco online
Una nuova versione è disponibile per il download
Verifica nuove versioni
Puntatore con offset
Cerca il puntatore col maggior offset disponibile
available from 2 step
Formula
Versione
Sempre in primo piano
Abilita "Sempre in primo piano"
Disabilita "Sempre in primo piano"
Verifica la tua connessione internet! Non riesco ad aprire systemsoftlab.com
Tenta di settare l'opzione
Nome/Modulo
Codice esadecimale
Registro
Flag
Collega il Debugger
Scollega il Debugger
Vuoi collegare il debugger al processo selezionato?
Lista dei Breakpoint
Comandi
Debug
Salva informazioni di debug
Carica informazioni di debug
Linguaggio Assembly
x86-32 bit
x86-64 bit
Breakpoint
Aggiungi breakpoint
Rimuovi breakpoint
Esegui
Esegui fino...
Fino al return
Traccia a step
Traccia a step over
Imposta nome indirizzo
Rimuovi nome indirizzo
Si
No
Tipo di Debugger
Standard
Gestione eccezioni
Tipo breakpoint eseguibile
Software (istruzione int3)
int3
Registri di Debug (max 4)
registro
Eccezioni di pagina
eccezuioni
Tipo breakpoint di accesso
Chiedi quando collegare il debugger al processo
Usa breakpoint software se tutti i registri di debug sono in uso
Salva/Carica automaticamente le info di debug
Usa simboli di debug
Percorso simboli
Attivo
Interrompere
Eseguire
Qualsiasi accesso
Scrivi
Condizioni
Modifiche
Abilita tutto
Disabilita tutto
Trova un'istruzione che sta accedendo all'indirizzo
Se accesso alla memoria
Se scrittura in memoria
Errore condizioni
Errore modifiche
Divisione per zero
Errore di lettura
Errore di scrittura
Errato left side
Start
Stop
Accedi
Cancella risultato
Dividi per i threads
Numero
Thread
8-bit
16-bit
32-bit
Hex
Hex
Float4
Float8
Sequenza esadecimale
il server systemsoflab.com non risponde o nessuna connessione ad internet
I codice di registrazione è bannato
Puoi attivare questo codice solo 2 volte al giorno
Il codice di registrazione è valido solo per l'edizione VIP
Nascondi debugger present
Salva la tabella in unicode
Ottieni dimensioni fino alla fine della funzione (fino al return)
Licenze
Scan memory regions
data writable
data readonly
code writable
code readonly
shared
system
guarded
hidden
Multiplicity of each address
Address names and symbols list
Folder symbols
User names
Case sensitive
Whole words
First position
Read/Write
Auto detect size of functions
Hide debug registers
Patch this functions (structures)
Aggira protezione del processo
Usa le proprie risorse per accedere alla memoria
User mode functions (attach to the process)
Kernel mode functions (via driver)
Attach to the process without OpenProcess
Signatures
Signature search
Add signature
Offset
Auto search
Static adress
Regions
Edit as the assembly code
As assembly code
Convert to HEX
Limit unique offsets per level
Code replacing
Replace the code
Replace all codes simultaneously
<REPLACED>
<NOT REPLACED>
<NO MODULE>
<NO BLOCK>
<NO SIGNATURE>
<NO VARIABLE>
Code injecting
Inject the code
Only after successed code replacing
Automatically replace all codes and inject
Allow to automatically replace all codes and inject
Ask for permission to automatically replace all codes and inject
The table contains a code for injection and replacement. It can be malicious code! Download tables only from most trusted websites! Do you want to inject the code in the process?
Replace all codes and inject
Cancel code replacing and injecting
Signature
Original Signature
Wrong original signature
Address of signature//full
Address of sign.//short
Address of variable/label//full
Address of variable//short
I can not convert the address of signature: No such signature.
I can not convert the address of variable: No such variable.
Name//variable or label
Code size for replacing 
One assembler instruction
Several assembler instructions
Line
Relative addressing error (offset is too big)
Invalid multiplier
Back jmp error
Cannot allocate memory
Areas//Memory areas
Set mirror address
Clear mirror address
from the minimum address
Service
Show pointer offsets in hexadecimal
Use RAX(EAX) register. Only MOV instruction with RAX(EAX) register can read/write an absolute address!
Change process speed
Your speed (%)
Normal//Speedd
Change process speed error
Increase process speed
Decrease process speed
Stack
View as stack
Save thread stack
Return adress
Parameter
Parameters
Show parameters in one line
Return address only in module
Read Memory Error
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D907BEF8